let fin = "";

//---------------Перша задача про вік----------------------------//
const year = prompt("Рік твого народження?");

if (isNaN(year) || 1900 > year || year > 2020) {
  alert("Шкода, що Ви не захотіли ввести свій вік");
} else {
  const age = 2023 - year;
  fin = `Твій вік: ${age}\n`;
}

//---------------Друга задача про місто----------------------------//
const home = prompt("Де ти живеш?");

switch (home) {
  case "Лондон":
    fin = "Ти живеш у столиці Великої Британії\n";
    break;
  case "Київ":
    fin = "Ти живеш у столиці України\n";
    break;
  case "Вашингтон":
    fin = "Ти живеш у столиці США\n";
    break;
  case "":
    alert("Шкода, що Ви не захотіли ввести своє місто");
    break;
  default:
    fin = fin + `Ти живеш у місті ${home}\n`;
    break;
}

//----------------Третя задача про спорт---------------------------//
const sport = prompt("Твій улюблений вид спорту?");

switch (sport) {
  case "Футбол":
    fin = fin + "Круто! Хочеш стати Кріштіану Роналду?\n";
    break;
  case "Баскетблол":
    fin = fin + "Круто! Хочеш стати Майклом Джорданом?\n";
    break;
  case "Плавання":
    fin = fin + "Круто! Хочеш стати Майклом Фелпсом?\n";
    break;
  case "":
    alert("Шкода, що Ви не захотіли ввести свій вид спорту");
    break;
  default:
    break;
}

alert(fin);
